# DBMS Lab Assignment

In [1]:
! pip install -r requirements.txt

In [2]:
import sqlalchemy
sqlalchemy.create_engine('sqlite:///dbms_lab_assginment.db')

Engine(sqlite:///dbms_lab_assginment.db)

In [3]:
%load_ext sql
%sql sqlite:///dbms_lab_assginment.db

In [4]:
%%sql 
CREATE TABLE Employee (
    Emp_id  varchar2(5) PRIMARY KEY,                         
    F_Name varchar2(15) NOT NULL,
    L_Name varchar2(15) NOT NULL, 
    city varchar(10),
    Gender char(1) ,                                                 
    Emp_hire_date  date,
    Job_code varchar(5),
    Supervisor_id  varchar(5),
    Dept_no number(4),
    CONSTRAINT CHK_gender CHECK (Gender IN ('M', 'm', 'F', 'f')),
    CONSTRAINT FK_SupervisorID FOREIGN KEY (Supervisor_id)
    REFERENCES Employee(Emp_id),
    CONSTRAINT FK_DeptNo FOREIGN KEY (Dept_no)
    REFERENCES Department(Dept_no)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [5]:
%%sql 
CREATE TABLE Department (
     DepNo number(4) PRIMARY KEY,
     DName varchar(15),
     Mgr_id char(9) NOT NULL,
     CONSTRAINT U_deptName UNIQUE (DName),
     CONSTRAINT FK_MgrID FOREIGN KEY (Mgr_id)
     REFERENCES Employee(Emp_id)

);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [6]:
%%sql 
CREATE TABLE Project(
    PNumber number(5) PRIMARY KEY,
    PName varchar(15) NOT NULL,
    DepNo number(4),
    CONSTRAINT FK_DepNum FOREIGN KEY (DepNo)
    REFERENCES Department(DepNo) 
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [7]:
%%sql 
CREATE TABLE Works_on (
    PNo number(5),
    emp_id varchar(5),
    CONSTRAINT FK_empID FOREIGN KEY (emp_id)
    REFERENCES Employee(Emp_id),
    CONSTRAINT FK_prjtnum FOREIGN KEY (PNo)
    REFERENCES Project(PNumber)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [8]:
%%sql 
CREATE TABLE Dependent (
     Emp_id varchar(5) PRIMARY KEY,
     Dependent_Name varchar(15) NOT NULL,                      
     Gender char(1), 
     CONSTRAINT CHK_gender CHECK (Gender IN ('M', 'm', 'F', 'f')),
     CONSTRAINT FK_empID FOREIGN KEY (emp_id)
     REFERENCES Employee(Emp_id)
);

* sqlite:///dbms_lab_assginment.db
Done.

[]

In [9]:
%%sql 
INSERT INTO Employee
('Emp_id','F_Name','L_Name','city','Gender','Emp_hire_date','Job_code','Supervisor_id','Dept_no')
VALUES
(888665555,'Saahil','Ali','Indore','M','2018-08-08','INTRN','NA',29),
(502,'William','SmithField','NYC','M','2004-06-22','502','WSMGR',44),
(503,'Rebeca','Black','Manhattan','F','2017-12-09','502','RBMGR',65),
(5,'Jada','Facer','Houston','F','2000-05-15','682','JFMKT',508),
(504,'John','Corner','Houston','M','2001-02-15','682','JCMKT',508),
(505,'Maria','Smith','Houston','F','2005-07-10','897','MSACT',508);

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [10]:
%%sql
SELECT * FROM Employee

* sqlite:///dbms_lab_assginment.db
Done.

[('888665555', 'Saahil', 'Ali', 'Indore', 'M', '2018-08-08', 'INTRN', 'NA', 29),
 ('502', 'William', 'SmithField', 'NYC', 'M', '2004-06-22', '502', 'WSMGR', 44),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '502', 'RBMGR', 65),
 ('5', 'Jada', 'Facer', 'Houston', 'F', '2000-05-15', '682', 'JFMKT', 508),
 ('504', 'John', 'Corner', 'Houston', 'M', '2001-02-15', '682', 'JCMKT', 508),
 ('505', 'Maria', 'Smith', 'Houston', 'F', '2005-07-10', '897', 'MSACT', 508)]

In [11]:
%%sql 
INSERT INTO Department
('DepNo','DName','Mgr_id')
VALUES 
(29,'InternsDept','888665555'),
(44,'Management','502'),
(65,'Logistics','503'),
(508,'Marketting','5');

* sqlite:///dbms_lab_assginment.db
4 rows affected.

[]

In [12]:
%%sql 
SELECT * FROM Department

* sqlite:///dbms_lab_assginment.db
Done.

[(29, 'InternsDept', '888665555'),
 (44, 'Management', '502'),
 (65, 'Logistics', '503'),
 (508, 'Marketting', '5')]

In [13]:
%%sql 
INSERT INTO Project
('PNumber','PName','DepNo')
VALUES
(3388,'ProjectF',29),
(1495,'Manage',44),
(5465,'Shipit',65),
(4578,'Sellit',508);

* sqlite:///dbms_lab_assginment.db
4 rows affected.

[]

In [14]:
%%sql 
SELECT * FROM Project

* sqlite:///dbms_lab_assginment.db
Done.

[(3388, 'ProjectF', 29),
 (1495, 'Manage', 44),
 (5465, 'Shipit', 65),
 (4578, 'Sellit', 508)]

In [15]:
%%sql 
INSERT INTO  Works_on 
('PNo', 'emp_id')
VALUES
(4578,'5'),
(3388,'888665555'),
(1495,'502'),
(5465,'503'),
(4578,'504'),
(4578,'505');

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [16]:
%%sql 
SELECT * FROM Works_on

* sqlite:///dbms_lab_assginment.db
Done.

[(4578, '5'),
 (3388, '888665555'),
 (1495, '502'),
 (5465, '503'),
 (4578, '504'),
 (4578, '505')]

In [17]:
%%sql 
INSERT INTO Dependent 
('Emp_id','Dependent_Name','Gender')
VALUES
('5','Aaron Facer','M'),
('888665555','Naazneen Ali','F'),
('502','Robin SmithField','M'),
('503','Kurtz Black','M'),
('504','Sarah Corner','F'),
('505','Will Smith','M');

* sqlite:///dbms_lab_assginment.db
6 rows affected.

[]

In [18]:
%%sql 
SELECT * FROM Dependent

* sqlite:///dbms_lab_assginment.db
Done.

[('5', 'Aaron Facer', 'M'),
 ('888665555', 'Naazneen Ali', 'F'),
 ('502', 'Robin SmithField', 'M'),
 ('503', 'Kurtz Black', 'M'),
 ('504', 'Sarah Corner', 'F'),
 ('505', 'Will Smith', 'M')]

3. Write the SQL code to change the job code to 501 for the person whose emp_id is'888665555'. After you have completed the task, examine the results, and then reset the job code to its original value.

In [19]:
%%sql 
UPDATE Employee
SET Job_code = '501'
WHERE Emp_id=888665555;
SELECT * FROM Employee

* sqlite:///dbms_lab_assginment.db
1 rows affected.
Done.

[('888665555', 'Saahil', 'Ali', 'Indore', 'M', '2018-08-08', '501', 'NA', 29),
 ('502', 'William', 'SmithField', 'NYC', 'M', '2004-06-22', '502', 'WSMGR', 44),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '502', 'RBMGR', 65),
 ('5', 'Jada', 'Facer', 'Houston', 'F', '2000-05-15', '682', 'JFMKT', 508),
 ('504', 'John', 'Corner', 'Houston', 'M', '2001-02-15', '682', 'JCMKT', 508),
 ('505', 'Maria', 'Smith', 'Houston', 'F', '2005-07-10', '897', 'MSACT', 508)]

In [20]:
%%sql 
UPDATE Employee
SET Job_code = 'INTRN'
WHERE Emp_id = 888665555;

* sqlite:///dbms_lab_assginment.db
1 rows affected.

[]

4. Write the SQL code that lists all details of employees with a job code of 502.

In [22]:
%%sql
SELECT * FROM Employee
WHERE Job_code = 502 ;

* sqlite:///dbms_lab_assginment.db
Done.

[('502', 'William', 'SmithField', 'NYC', 'M', '2004-06-22', '502', 'WSMGR', 44),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '502', 'RBMGR', 65)]

5. Write the SQL code to delete the row for the person named William Smithfield, who was hired on June 22, 2004, and whose job code classification is 502. (Hint: Use logical operators to include all the information given in this problem.)

In [23]:
%%sql 
DELETE FROM Employee 
WHERE Job_code = 502 AND 
Emp_hire_date='2004-06-22' AND 
F_Name = 'William' AND 
L_Name = 'SmithField';
SELECT * FROM Employee

* sqlite:///dbms_lab_assginment.db
1 rows affected.
Done.

[('888665555', 'Saahil', 'Ali', 'Indore', 'M', '2018-08-08', 'INTRN', 'NA', 29),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '502', 'RBMGR', 65),
 ('5', 'Jada', 'Facer', 'Houston', 'F', '2000-05-15', '682', 'JFMKT', 508),
 ('504', 'John', 'Corner', 'Houston', 'M', '2001-02-15', '682', 'JCMKT', 508),
 ('505', 'Maria', 'Smith', 'Houston', 'F', '2005-07-10', '897', 'MSACT', 508)]

6. List the names of all employees who work in department 508.

In [24]:
%%sql 
SELECT F_Name,L_Name FROM Employee
WHERE Dept_no = 508 ;

* sqlite:///dbms_lab_assginment.db
Done.

[('Jada', 'Facer'), ('John', 'Corner'), ('Maria', 'Smith')]

7. Add a new column named salary in employee table.

In [28]:
%%sql
ALTER TABLE Employee
ADD Salary number(10) ;
SELECT * FROM Employee

* sqlite:///dbms_lab_assginment.db
Done.
Done.

[('888665555', 'Saahil', 'Ali', 'Indore', 'M', '2018-08-08', 'INTRN', 'NA', 29, None),
 ('503', 'Rebeca', 'Black', 'Manhattan', 'F', '2017-12-09', '502', 'RBMGR', 65, None),
 ('5', 'Jada', 'Facer', 'Houston', 'F', '2000-05-15', '682', 'JFMKT', 508, None),
 ('504', 'John', 'Corner', 'Houston', 'M', '2001-02-15', '682', 'JCMKT', 508, None),
 ('505', 'Maria', 'Smith', 'Houston', 'F', '2005-07-10', '897', 'MSACT', 508, None)]

In [46]:
%%sql
UPDATE Employee
SET Salary = 25000
WHERE Emp_id = 888665555 ;
UPDATE Employee
SET Salary = 35000
WHERE Emp_id = 503 ;
UPDATE Employee
SET Salary = 100000
WHERE Emp_id = 5 ;
UPDATE Employee
SET Salary = 90000
WHERE Emp_id = 504 ;
UPDATE Employee
SET Salary = 49000
WHERE Emp_id = 505 ;

* sqlite:///dbms_lab_assginment.db
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

8. List names and salaries of all employee ordered by salary.

In [48]:
%%sql 
SELECT F_Name,Salary FROM Employee
ORDER BY Salary ASC;

* sqlite:///dbms_lab_assginment.db
Done.

[('Saahil', 25000),
 ('Rebeca', 35000),
 ('Maria', 49000),
 ('John', 90000),
 ('Jada', 100000)]

9. List the name of employees whose salary is between 30000 and 50000.

In [49]:
%%sql 
SELECT F_Name FROM Employee
WHERE Salary BETWEEN 30000 AND 50000

* sqlite:///dbms_lab_assginment.db
Done.

[('Rebeca',), ('Maria',)]

10. List the name of employees who lives in Houston.

In [50]:
%%sql 
SELECT F_Name FROM Employee
WHERE city='Houston'

* sqlite:///dbms_lab_assginment.db
Done.

[('Jada',), ('John',), ('Maria',)]